In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('animals.csv')
df.head()

      animal id   age weight  length
0    hamster  1   1.0      7     NaN
1  alligator  2   9.0     13     6.0
2  alligator  2   9.0     13     6.0
3    hamster  3   5.0      8     9.0
4        cat  3  13.0     12     1.0

#### groupby ()

In [5]:
#Now you can use the .groupby() method to group rows together based on a column name.
#For instance let's group based on Animal. This will create a DataFrameGroupBy object:
by_animal = df.groupby("animal")
print(type(by_animal))
print(by_animal)#this type of object is not very usefull, but there are numberous interesting fuction to work on it

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000026CB41C7848>

In [6]:
by_animal.describe()

            age                                                      length  \
          count       mean       std   min    25%   50%    75%   max  count
animal
alligator   3.0   8.333333  1.154701   7.0   8.00   9.0   9.00   9.0    3.0
book        1.0  56.000000       NaN  56.0  56.00  56.0  56.00  56.0    0.0
cat         4.0  10.250000  4.500000   4.0   8.50  11.5  13.25  14.0    4.0
hamster     4.0   5.500000  5.916080   1.0   1.75   3.5   7.25  14.0    3.0
snake       1.0   7.000000       NaN   7.0   7.00   7.0   7.00   7.0    1.0
ssnake      1.0  14.000000       NaN  14.0  14.00  14.0  14.00  14.0    1.0


               mean       std  min   25%  50%   75%  max
animal
alligator  5.666667  0.577350  5.0  5.50  6.0  6.00  6.0
book            NaN       NaN  NaN   NaN  NaN   NaN  NaN
cat        5.500000  3.316625  1.0  4.75  6.0  6.75  9.0
hamster    6.666667  2.081666  5.0  5.50  6.0  7.50  9.0
snake      6.000000       NaN  6.0  6.00  6.0  6.00  6.0
ssnake     8.000000       NaN  8.0  8.00  8.0  8.00  8.0

In [7]:
by_animal.mean() # we can also use min, max , median, count etc

                 age    length
animal
alligator   8.333333  5.666667
book       56.000000       NaN
cat        10.250000  5.500000
hamster     5.500000  6.666667
snake       7.000000  6.000000
ssnake     14.000000  8.000000

#### size()

In [8]:
print(by_animal.size())#Series

animal
alligator    3
book         1
cat          4
hamster      4
snake        1
ssnake       1
dtype: int64

In [21]:
for index_animal, value in by_animal.size().items():
    print (index_animal , " : ",indexes)

alligator  :  1
book  :  1
cat  :  1
hamster  :  1
snake  :  1
ssnake  :  1

In [15]:
print(by_animal.size().index) ##Doesn't it look like a list??
print(by_animal.size().index.tolist())

Index(['alligator', 'book', 'cat', 'hamster', 'snake', 'ssnake'], dtype='object', name='animal')
['alligator', 'book', 'cat', 'hamster', 'snake', 'ssnake']

In [16]:
by_animal.size().values.tolist() ##Doesn't it look like a list??

[3, 1, 4, 4, 1, 1]

#### get_group()

In [10]:
#Print all rows of hamster group
print (by_animal.get_group('hamster'))
print(type(by_animal.get_group('hamster')))

     animal  id   age weight  length
0   hamster   1   1.0      7     NaN
3   hamster   3   5.0      8     9.0
7   hamster   7   2.0     10     5.0
11  hamster  11  14.0     10     6.0
<class 'pandas.core.frame.DataFrame'>

In [11]:
print ("Mean on all numerical values regarding hamsters: \n",by_animal.get_group('hamster').mean())#series
print()
print ("The heaviest hamster weights :",by_animal.get_group('hamster')['weight'].max(), " kilos")#simple value

Mean on all numerical values regarding hamsters:
 id          3427.750000
age            5.500000
weight    195252.500000
length         6.666667
dtype: float64

The heaviest hamster weights : 8  kilos

#### groups - attribute

In [12]:
#View Groups
print (by_animal.groups)#Doesn't it look like a dict??

{'alligator': Int64Index([1, 2, 12], dtype='int64'), 'book': Int64Index([13], dtype='int64'), 'cat': Int64Index([4, 6, 8, 9], dtype='int64'), 'hamster': Int64Index([0, 3, 7, 11], dtype='int64'), 'snake': Int64Index([10], dtype='int64'), 'ssnake': Int64Index([5], dtype='int64')}

In [14]:
for animal, index in by_animal.groups.items():
    print (animal,' : can be found in index(es) ', index.tolist())

alligator  : can be found in index(es)  [1, 2, 12]
book  : can be found in index(es)  [13]
cat  : can be found in index(es)  [4, 6, 8, 9]
hamster  : can be found in index(es)  [0, 3, 7, 11]
snake  : can be found in index(es)  [10]
ssnake  : can be found in index(es)  [5]